# import random
# # 剪刀 = 0， 石头 = 1， 布 = 2
# player = int(input("石头剪刀布："))
# while True:
#     computer = random.randint(0, 2)
#     if player == 3:
#         print("游戏结束")
#         break
#     if player > 3:
#         player = int(input("请输入正确的数字："))
#     elif (player == 0 and computer == 2) or (player == 2 and computer == 1) or (player == 1 and computer == 0):
#         print("玩家：%d, 电脑： %d" % (player, computer))
#         print("恭喜你胜利了")
#         player = int(input("石头剪刀布："))
#     elif player == computer:
#         print("玩家：%d, 电脑： %d" % (player, computer))
#         print("不要走决战到天亮")
#         player = int(input("石头剪刀布："))
#     else:
#         print("玩家：%d, 电脑： %d" % (player, computer))
#         print("失败咯")
#         player = int(input("石头剪刀布："))

# sum = 0
# a = 1
# while a <= 100:
#     sum = sum + a
#     a += 1
#     print(sum)

# i = 1
# sum = 0
#
# while i <= 100:
#     if i % 2 == 0:
#         sum = sum + i
#
#     i = i + 1
#
# print("1--100之间的偶数和为 %d " % sum)

# i = 1
# jishu = 0
# while i <= 100:
#     if i % 2 == 1:
#         jishu = jishu + i
#     i = i + 1
# print(jishu)

# print(bin(112))         # 10转2进制
# print(oct(112))         # 10转8进制
# print(hex(112))         # 10转16进制
# print(int(0b1110000))   # 2转10进制
# print(int(0o160))       # 2转8进制
# print(int(0x70))        # 2转16进制

"""
小数计算引用decimal库里面的Decimal进行计算
"""
# from decimal import Decimal
# print(Decimal('11.2') + Decimal('11.2') - Decimal('22.4'))
# print(6 ** 2)
# import platform

"""
    对于不可变类型的对象，内存可能会被重用，比如小的整数对象，。
    使用id函数进行验证，内置函数id用于返回对象的唯一标识。（对象在内存中的唯一地址）
"""
# a = 9992
# b = 9902
# print(a == b)  # False
# print(id(a))  # 4502353168
# print(id(b))  # 4502353232

# a = 12
# print(id(a))
# b = 122
# print(id(b))
# print(a == b)
# print(a is b)
#  "is"是比较的是两个对象的id值是否相等，也就是比较俩对象是否为同一个实例对象，是否指向同一个内存地址。

"""
对象None 用于变量的初始化，或将变量重置为"数据值不存在的状态"
"""

# a = 1
# print(a)
# a = None
# print(a)

""" 
    range是一种序列类型，表示不可变的整数序列
    可以调用内置函数range，创建range类型的对象，有三种方式
    range(stop)   传入一个参数
    range(start,stop)  传入两个参数
    range(start,stop,step)  传入三个参数
其中，整数序列的起始的默认值为0.使用参数start指定；
     可以使用参数stop指定整数序列的结束值；创建的range对象不包含stop
     整数序列的布长的默认值为1，使用参数step指定
     
     内置函数range返回值是一个迭代的对象，为了清楚的标识返回的迭代器对象所表示的整数序列，
     可以将其转换成列表
     不管range对象有多长，所有range对象所占用的内存空间都是相同的，
     只需要存储start，stop，step。只有用到range对象的时候，才会去计算序列中的相关元素
"""
#
# print(range(5))
#
# print(list(range(5)))
#
# print(list(range(0, 5, 2)))
#
# print(3 in range(5))  # 用in来检查range5中是否含有整数3
# print(6 not in range(5))  # 用not in 来检查range5中是否不存在整数8

# A = [i for i in range(1,101)]
# print(A[::-1])
"""
列表创建:
L = [1, 2, 3, 4]
print(L)

print(list(range(1, 5)))

print(list())
"""

# 调用索引index

# a = [1, 2, 3, 4, 5, 3, 6]
# print(a.index(3))  # 2

"""
    如果列表中含有多个指定元素，index返回第一个指定元素的索引
    如果列表中不存在指定元素，index返回 ValueError
    调用index时使用起始索引start结束索引stop。
    起始索引包含指定索引，
    结束索引不包含指定索引。
"""

# print(a.index(3, 3))  # 从索引 3 开始，查找元素 3 在列表中的索引。
# print(a.index(3, 3, 6))  # 从索引 3 开始，索引 6 结束， 在列表中查找元素 3 在列表中的索引。

# 使用索引获得列表中的单个元 素，
# a = [1, 2, 3, 4, 5]
# print(a[1])
# print(a[-4])

# a = [1, 2, 3, 4, 5, 6]
# print(a[::-1])
#
# print(4 in a)
# print(9 in a)
# print(4 not in a)
# print(9 not in a)
"""
    修改列表中的元素，
为指定索引的元素赋予一个新值。(一次只修改一个元素)
为指定的切片赋予一个新值。(一次至少修改一个新值)
"""

# a = [1, 2, 3, 4, 5]
# a[2] = 9
# print(a)

# 二

# a[1:3] = [99, 12]
# print(a)  # [1, 99, 12, 4, 5]
# a[0:1] = [5]
# print(a)
# a[1:4] = [1, 7]
# print(a)  # [1, 1, 7, 5]

"""
    列表末尾添加一个元素(只添加一个元素)
"""
# a = [1, 2, 3, 4, 5]

# a.append(6)
# print(a)

# a.append([7, 8, 9])  # [1, 2, 3, 4, 5, 6, [7, 8, 9]]
# print(a)
"""
列表末尾添加多个元素。(至少添加一个元素)
"""
# a = [1, 2, 3, 4, 5, 6, 7, 8, 9]
#
# a.extend([10, 11])
# print(a)

"""
列表中任意位置插入一个元素，使用insert
"""

# a = [1, 2, 3, 4, 5]

# a.insert(3, 5)
# print(a)  # [1, 2, 3, 5, 4, 5]
#
# a.insert(len(a), 6)   # 使用内置函数len ，获取列表中的元素个数。
# print(a)

"""
    为指定的切片赋予一个新值(在列表中的任意位置一次至少添加一个元素)
"""

# a = [1, 2, 3, 4, 5]
#
# a[2:2] = [9, 6]
# print(a)  # [1, 2, 9, 6, 3, 4, 5]
#
# a[len(a):] = [6, 7]  # [1, 2, 9, 6, 3, 4, 5, 6, 7]
# print(a)

# a = [1, 2, 3, 5, 2, 6, 7]
#
# a[2:5] = [3, 4, 5]
# print(a)

#
#  data：6.1
"""
列表的删除操作：
调用remove方法，指定的为元素
"""
# a = [3, 4, 5, 6, 7]
# a.remove(5)
# print(a)  # [3, 4, 6, 7]
#
# b = [3, 4, 5, 4, 6]
# b.remove(4)
# print(b)  # [3, 5, 4, 6]  如果存在多个相同元素，，只删除第一个元素。

"""
调用方法pop（一次只删除一个指定索引的元素）
返回被删除的元素
"""
# a = [3, 4, 5, 6, 7]
# a.pop(2)
# print(a)  # [3, 4, 6, 7]
#
# print(a.pop(2))  # 6
#
# print(a)  # [3, 4, 7]
#
# print(a.pop())  # 7 如果未指定元素，删除列表中最后一个元素
# print(a)  # [3, 4]
"""
使用del语句，一次至少删除一个元素。del指定索引
"""

# a = [1, 2, 3, 4, 5, 6]
# del a[2]
# print(a)   # [1, 2, 4, 5, 6]
# del a[1:3]  # [1, 5, 6] 通过列表切片，一次删除多个元素。
# print(a)

"""
给指定的切片赋值一个空列表，一次至少删除一个元素 
"""
# a = [1, 2, 3, 4, 5, 6]
#
# a[3:4] = []
# print(a)  # [1, 2, 3, 5, 6]
# # 请空列表
# a[:] = []
# print(a)  # []

"""
使用clear请空列表
"""

# a = [1, 2, 3, 4, 5, 6]
#
# a.clear()
# print(a)  # []

"""
使用加法运算列表
可以使用加法运算符将两个列表合并后生成一个新的列表，被合并的列表不发生任何变化。
"""

# a1 = [1, 2, 3]
# a2 = [4, 5, 6]
# a3 = a1 + a2
# print(a3)  # [1, 2, 3, 4, 5, 6]
# print(a2)  # [4, 5, 6]
# print(a1)  # [1, 2, 3]

# a1 = a2 = [1, 2]
# a1 = a1 + [3, 4]
# print(a1, a2)  # [1, 2, 3, 4] [1, 2]
#
# a1 = a2 = [1, 2]
# a1 += [3, 4]
# print(a1, a2)  # [1, 2, 3, 4] [1, 2, 3, 4] 参数赋值运算符+= ，会对列表本身进行修改。

"""
使用乘法运算列表
被乘的列表不发生任何变化，被乘后的列表重复打印*次，生成一个新的列表。 
"""
# a1 = [1, 2, 3, 4]
# a = a1 * 3
# print(a)  # [1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4]
# print(a1)  # [1, 2, 3, 4]
#
# a = [0] * 5
# print(a)  # [0, 0, 0, 0, 0]  常用于列表的初始化。

# a1 = a2 = [1, 2, 3]
# a1 = a1 * 3
# print(a1, a2)  # [1, 2, 3, 1, 2, 3, 1, 2, 3] [1, 2, 3]
#
# # 参数赋值运算，使用*=会对列表进行更改，会对列表本身进行修改
#
# a1 = a2 = [1, 2, 3]
# a1 *= 3
# print(a1)  # [1, 2, 3, 1, 2, 3, 1, 2, 3]
# print(a2)  # [1, 2, 3, 1, 2, 3, 1, 2, 3]

"""
比较运算符对两个列表比较
> , >= , >= , < , <= , == , !=
从第一个元素进行比较，如果相等比较下一个元素，以此类推，直到两个元素不相等。两个列表中所有元素都不被比较
"""
# a = [1, 2, 3, 4, 5]
# b = [1, 2, 3, 5, 6]
# print(a > b)  # False
#
# print([3, [2, 6]] > [3, [2, 5]])  # Ture
"""
也可以使用is进行比较  
is是同一性测试， == 是相同性测试
"""
# a = b = [1, 2, 3]
# c = [1, 2, 3]
#
# print(a == b)  # True
# print(a == c)  # True
#
# print(a is b)  # True
# print(a is c)  # False
"""
列表的翻转：
1、调用方法reverse
"""
# a = [1, 2, 3, 4, 5]
# a.reverse()
# print(a)
#
# # 2.调用内置函数reversed    返回值为迭代器对象，且被翻转的列表不发生变化。
# a = [1, 2, 3 , 4, 5]
#
# print(reversed(a))  # <list_reverseiterator object at 0x10e0ebfa0> = 列表翻转迭代器对象
# print(list(reversed(a)))  # [5, 4, 3, 2, 1]

"""
列表的排序
1，对列表中的所有元素进行排序，调用方法sort,默认按照从小到大排序.
"""

# a = [2, 4, 5, 7, 6]
# a.sort()
# print(a)  # [2, 4, 5, 6, 7]

"""
调用方法 sort时，可以指定参数reverse = Ture ，从大到小排序
"""

# a.sort(reverse=True)  # [2, 4, 5, 6, 7]
# print(a)

"""
2.调用内置函数sorted 
    内置函数sorted的返回值是排序后的新列表，且排序的列表不发生变化。
"""

# a = [2, 4, 5, 7, 6]
# print(sorted(a))  # [2, 4, 5, 6, 7]
# print(a)  # [2, 4, 5, 7, 6]

"""
2.调用内置函数sorted时，可以指定参数reverse = Ture ，从大到小排序
"""

# print(sorted(a, reverse=True))  # [7, 6, 5, 4, 2]
# print(a)  # [2, 4, 5, 7, 6]


"""
多维列表
当列表中的元素也是列表，就构成了多维列表，例如:当列表中的元素是一维列表时，就构成了二维列表，；当列表中的元素是二维列表时，
就构成了三维列表，因此，可以把多维列表看做是特殊的一维列表。

1、一维列表的操作也适用于多维列表
"""
# a = [[3, 4], [1, 5, 2], [3, 4, 5, 6]]
#
# print(a[2][3])  # 6  在列表a中索引为2 里面 索引为 3 的 元素为6
#
# a[1] = 2  # 把列表内索引为1的元素重新赋值为2
# print(a)  # [[3, 4], 2, [3, 4, 5, 6]]
#
# a.append([3, 4])  # 在列表的末尾添加一个元素
# print(a)  # [[3, 4], 2, [3, 4, 5, 6], [3, 4]]
#
# a.extend([[3, 4], [5, 6]])  # 在列表的末尾添加多个元素
# print(a)  # [[3, 4], 2, [3, 4, 5, 6], [3, 4], [3, 4], [5, 6]]
#
# a.remove([5, 6])  # 指定元素为[5, 6]的进行删除。
# print(a)  # [[3, 4], 2, [3, 4, 5, 6], [3, 4], [3, 4]]
#
# a.pop(3)  # 删除指定列表索引为3的指定元素 一次只能删除一个，如果未指定索引，默认删除最后一个元素
# print(a)  # [[3, 4], 2, [3, 4, 5, 6], [3, 4]]  pop指定的为列表的索引
#
# del a[2:3]  # 删除指定索引到结束索引内的元素
# print(a)  # [[3, 4], 2, [3, 4]]
#
# b = [[3, 4], 2, [3, 4, 5, 6], [3, 4], [3, 4], [5, 6]]
#
# del b[2:len(b)]  # 删除指定索引到列表最后的所有元素。
# print(b)  # [[3, 4], 2]
#
# b.insert(1, [[1, 2], [2, 3]])  # 在指定元素位置前，添加元素
# print(b)  # [[3, 4], [[1, 2], [2, 3]], 2]
#
# """
# 多维列表的初始化
# """
# # 一维列表初始化
# print([0] * 3)  # [0, 0, 0]
#
# # 多维列表的初始化
# print([[0] * 3] * 4)  # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]
#
# # 列表生成式
# print([0 for i in range(3)])  # [0, 0, 0]
#
# print([[0 for i in range(3)] for j in range(4)])  # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]


# print([[[0] * 3] for i in range(4)])  # [[[0, 0, 0]], [[0, 0, 0]], [[0, 0, 0]], [[0, 0, 0]]]

"""
 元组：内置数据结构之一
元组和列表的区别:列表可以更改，列表用[]表示
              元组不可以更改，用()表示
"""
# a = ("hello", 1, True)
# print(a)  # ('hello', 1, True)
#
# a = "hello", 1, True  # 小括号是可以省略的
# print(a)  # ('hello', 1, True)

"""
空列表的表示方式：
"""

# a = (())
# print(a)  # ()
#
# a = (tuple())
# print(a)  # ()

"""
不可变类型的对象，对象内部所有数据就不能被修改了，这样就避免了由于修改数据导致的错误。此外，对于不可变类型的对象，
在多任务环境下同时操作对象时不需要加锁。因此，在程序中尽量使用不可变类型的对象。
"""

# a = ("hello", 1, True)
# # a[1] = 2
# print(a)  # TypeError: 'tuple' object does not support item assignment

# a = ("hello", [1, 2, 3], True)
# a[1][2] = 3
# print(a)  # ('hello', [1, 2, 3], True)
# 元组内的列表是可以进行更改的，因为元组储存的是元素在内存的地址，因此，地址不可以改变，地址内可以改变

"""
只包含一个元素的元组
"""

# a = (11)
# print(a)  # 11
# print(type(a))  # <class 'int'>

"""
元组中至少要包含一个,否则，会被看成数学公式中的小括号，
"""

# a = (11,)
# print(a)  # (11,)
# print(type(a))  # <class 'tuple'>

"""
多个变量同时赋值：
赋值运算符左边可以是一个所有元素都为变量的元组或列表，从而一次给多个变量同时赋值
注意左右两边元素个数必须相同，否则报出ValueError
"""

# a, b = [3, 4]
# print(a, b)  # 3 4
#
# a, b = (5, 8)
# print(a, b)  # 5 8
#
# [a, b] = 1, 3
# print(a, b)  # 1 3

"""
可以在赋值运算符前面 加*号以匹配赋值运算符右边的0或多个元素。
"""

# *a, b = 1, 2, 3, 4, 5
# print(a, b)  # [1, 2, 3, 4] 5     *a = [1, 2, 3, 4]
#
# a, *b, c = 1, 2
# print(a, b, c)  # 1 [] 2

"""
交换两个变量的值
"""

a = 5
b = 3
temp = a
a = b
b = temp
print(a, b)  # 3 5

a = 3
b = 4
a, b = 4, 3
print(a, b)  # 4 3




